In [1]:
import pandas as pd
import glob 
import os

In [2]:
Dir = 'S:\\Datasets\\DE\\data'

## Reading All CSV files within a Folder

In [3]:
all_files_path=glob.glob(Dir +'\\*.csv')
all_files_path

['S:\\Datasets\\DE\\data\\customers.csv',
 'S:\\Datasets\\DE\\data\\geolocation.csv',
 'S:\\Datasets\\DE\\data\\orders.csv',
 'S:\\Datasets\\DE\\data\\order_items.csv',
 'S:\\Datasets\\DE\\data\\order_payments.csv',
 'S:\\Datasets\\DE\\data\\order_reviews.csv',
 'S:\\Datasets\\DE\\data\\products.csv',
 'S:\\Datasets\\DE\\data\\product_category_name_translation.csv',
 'S:\\Datasets\\DE\\data\\sellers.csv']

In [4]:
file_names=os.listdir(Dir)
f_list=[]
for i in range(len(file_names)):    
    f_list.append(file_names[i].split('.')[0])
f_list

['customers',
 'geolocation',
 'orders',
 'order_items',
 'order_payments',
 'order_reviews',
 'products',
 'product_category_name_translation',
 'sellers']

In [5]:
dfs={}
for s in range(len(all_files_path)):
    dfs[f_list[s]]=pd.read_csv(all_files_path[s])

In [6]:
dfs['products']

,product_id,product_category_name,product_name_lenght,product_description_lenght,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,1e9e8ef04dbcff4541ed26657ea517e5,perfumaria,40.0,287.0,1.0,225.0,16.0,10.0,14.0
1,3aa071139cb16b67ca9e5dea641aaa2f,artes,44.0,276.0,1.0,1000.0,30.0,18.0,20.0
2,96bd76ec8810374ed1b65e291975717f,esporte_lazer,46.0,250.0,1.0,154.0,18.0,9.0,15.0
3,cef67bcfe19066a932b7673e239eb23d,bebes,27.0,261.0,1.0,371.0,26.0,4.0,26.0
4,9dc1a7de274444849c219cff195d0b71,utilidades_domesticas,37.0,402.0,4.0,625.0,20.0,17.0,13.0
...,...,...,...,...,...,...,...,...,...
32946,a0b7d5a992ccda646f2d34e418fff5a0,moveis_decoracao,45.0,67.0,2.0,12300.0,40.0,40.0,40.0
32947,bf4538d88321d0fd4412a93c974510e6,construcao_ferramentas_iluminacao,41.0,971.0,1.0,1700.0,16.0,19.0,16.0
32948,9a7c6041fa9592d9d9ef6cfe62a71f8c,cama_mesa_banho,50.0,799.0,1.0,1400.0,27.0,7.0,27.0
32949,83808703fc0706a22e264b9d75f04a2e,informatica_acessorios,60.0,156.0,2.0,700.0,31.0,13.0,20.0
32950,106392145fca363410d287a815be6de4,cama_mesa_banho,58.0,309.0,1.0,2083.0,12.0,2.0,7.0

##  INNER JOIN 2 tables

```
SELECT  COUNT(*) 
FROM orders o 
INNER JOIN customers c
    ON o.customer_id = c.customer_id

```
O/P: 99441 ROWS

In [7]:
dfs['orders'].merge(dfs['customers'],\
                     how='inner',\
                     left_on=['customer_id'], right_on = ['customer_id']
                    )\
                   .shape

(99441, 12)

##  INNER JOIN 3 tables

```
select COUNT(*)
from orders o 
inner join customers c
    on o.customer_id = c.customer_id
inner join order_items oi
	on o.order_id = oi.order_id

```
O/P: 112650 ROWS

In [8]:
dfs['orders'].merge(dfs['customers'],\
                     how='inner',\
                     left_on=['customer_id'], right_on = ['customer_id']
                    )\
                   .merge(dfs['order_items'],\
                          how='inner',\
                          left_on=['order_id'],right_on=['order_id']
                         )\
                   .shape

(112650, 18)

##  LEFT JOIN

```
SELECT COUNT(*)
FROM orders o 
LEFT JOIN order_items oi
	ON o.order_id = oi.order_id

```
O/P: 113425 ROWS

In [9]:
dfs['orders'].merge(dfs['order_items'],\
                          how='left',\
                          left_on=['order_id'],right_on=['order_id']
                         )\
                   .shape

(113425, 14)

##  RIGHT JOIN

```
SELECT COUNT(*)
FROM orders o 
RIGHT JOIN order_items oi
	ON o.order_id = oi.order_id

```
O/P: 112650 ROWS

In [10]:
dfs['orders'].merge(dfs['order_items'],\
                          how='right',\
                          left_on=['order_id'],right_on=['order_id']
                         )\
                   .shape

(112650, 14)

##  FULL OUTER JOIN

MySQL does not support direct full join hence combination of left and Right join
```
SELECT COUNT(*)
FROM (
        SELECT o.*
        FROM orders o 
        LEFT JOIN order_items oi
            ON o.order_id = oi.order_id
        UNION ALL
        SELECT a.*
        FROM orders a 
        RIGHT JOIN order_items b
        ON a.order_id = b.order_id
)c ;

```
O/P: 226075 ROWS

In [22]:
dfs['orders'].merge(dfs['order_items'],\
                          how='outer',\
                          left_on=['order_id'],right_on=['order_id']
                         )\
                   .shape

(113425, 14)

##  INNER & LEFT JOIN combination

```
select COUNT(*)
from orders o 
inner join customers c
    on o.customer_id = c.customer_id
left join order_items oi
	on o.order_id = oi.order_id

```
O/P: 113425 ROWS

In [12]:
dfs['orders'].merge(dfs['customers'],\
                     how='inner',\
                     left_on=['customer_id'], right_on = ['customer_id']
                    )\
                   .merge(dfs['order_items'],\
                          how='left',\
                          left_on=['order_id'],right_on=['order_id']
                         )\
                   .shape

(113425, 18)

##  CROSS JOIN

```
SELECT COUNT(*)
FROM orders o 
CROSS JOIN order_items oi

```
O/P: 11202028650 ROWS

In [13]:
# dfs['orders'].merge(dfs['order_items'],\
#                           how='cross',\
#                          )\
#                    .shape

# MemoryError: Unable to allocate 83.5 GiB for an array with shape (11202028650,) and data type int64
#you can see same number of rows in the error statement : shape(11202028650,)

##  SELF JOIN

```
SELECT count(*)
FROM order_items o 
JOIN order_items oi
  ON o.order_id = oi.order_id
  
   (or)
   
SELECT count(*)
FROM order_items o, order_items oi
 where o.order_id = oi.order_id
 
```
O/P: 157222 ROWS

In [14]:
dfs['order_items'].merge(dfs['order_items'],\
                          how='inner',\
                         left_on=['order_id'],right_on=['order_id']
                         )\
                   .shape

(157222, 13)

# UNION and UNION All

In [15]:
t1 = {"name": ['Shafi','Shaik','Mohiddin'],
     "skill":['SQL','Python','Tableau'],
     "salary": [200,300,200]}
t2 = {"name": ['Ravi','Teja','Mohiddin'],
     "skill":['R','AWS','Tableau'],
     "salary": [200,300,200]}

In [16]:
df1=pd.DataFrame(t1)
df1

       name    skill  salary
0     Shafi      SQL     200
1     Shaik   Python     300
2  Mohiddin  Tableau     200

In [17]:
df2=pd.DataFrame(t2)
df2

       name    skill  salary
0      Ravi        R     200
1      Teja      AWS     300
2  Mohiddin  Tableau     200

```
SELECT * FROM df1
UNION ALL
SELECT * FROM df2 
 
```
<!-- 
Shafi	SQL	200
Shaik	Python	300
Mohiddin	Tableau	200
Ravi	R	200
Teja	AWS	300
Mohiddin	Tableau	200
 -->

In [18]:
pd.concat([df1,df2])

       name    skill  salary
0     Shafi      SQL     200
1     Shaik   Python     300
2  Mohiddin  Tableau     200
0      Ravi        R     200
1      Teja      AWS     300
2  Mohiddin  Tableau     200

```
SELECT * FROM df1
UNION 
SELECT * FROM df2 
 
```
<!-- 
Shafi	SQL	200
Shaik	Python	300
Mohiddin	Tableau	200
Ravi	R	200
Teja	AWS	300
Mohiddin	Tableau	200
 -->

In [19]:
pd.concat([df1,df2,df1]).drop_duplicates()

       name    skill  salary
0     Shafi      SQL     200
1     Shaik   Python     300
2  Mohiddin  Tableau     200
0      Ravi        R     200
1      Teja      AWS     300

## Horizontal Concatenation - Not present in SQL

In [20]:
pd.concat([df1,df2],axis='rows')

       name    skill  salary
0     Shafi      SQL     200
1     Shaik   Python     300
2  Mohiddin  Tableau     200
0      Ravi        R     200
1      Teja      AWS     300
2  Mohiddin  Tableau     200

In [21]:
pd.concat([df1,df2,df1],axis='columns')

,name,skill,salary,name,skill,salary,name,skill,salary
0,Shafi,SQL,200,Ravi,R,200,Shafi,SQL,200
1,Shaik,Python,300,Teja,AWS,300,Shaik,Python,300
2,Mohiddin,Tableau,200,Mohiddin,Tableau,200,Mohiddin,Tableau,200

 ##### Author: &lt; Shafi Mohiddin Shaik&gt; <hr> LinkedIn : [Click to get redirected to Shafi's Linkedin Page]( https://www.linkedin.com/in/shafi-shaik-0279651b0/)